1. Написать программу которая будет искать в слове введенного с клавиатуры слово cat.
Дополнительно вывести сколько раз слово cat содержится в виденном сочетании букв. 
Например в “catMyCatLovecat”

2. Используя метод replace cделать из кита – кота.

3. Используя метод substring получите кот из слова “скотина”

Дополнительное задание:
4. Дан текст, который содержит различные английские буквы и знаки препинания. 
   Вам необходимо найти самую частую букву в тексте. Результатом должна быть буква в нижнем регистре.
   При поиске самой частой буквы, регистр не имеет значения, так что при подсчете считайте, что "A" == "a". 
   Убедитесь, что вы не считайте знаки препинания, цифры и пробелы, а только буквы.

   Если в тексте две и больше буквы с одинаковой частотой, тогда результатом будет буква, которая идет первой в алфавите. 
   Для примера, "one" содержит "o", "n", "e" по одному разу, так что мы выбираем "e".

5. Написать статический метод writeLine класса Console, который повторяет поведение метода Console.WriteLine в c#.
Первым  аргументом метода будет форматированная строка вида "{0} {1} {2}", где {0}, {1} и т.д. - позиционные аргументы.
Позиционные аргументы передаются в виде объектов.

Прототип метода:
	void writeLine(String format, Object... args).

args - массив объектов
